[
    {
        "titulo": "Gif Expert",
        "imagen": "/proyectos/framework/Gif.png",
        "galeria": [
            "/proyectos/framework/Gif1.png",
            "/proyectos/framework/Gif2.png"
        ],
        "descripcion": "Una pagina web que permite buscar y visualizar GIFs utilizando la API de Giphy, desarrollada con React y Vite.",
        "proposito": "El propósito de este proyecto es aprender a consumir APIs externas y manejar el estado en una aplicación React utilizando Vite como herramienta de construcción.",
        "funcionamiento": "En un panel de búsqueda, el usuario puede ingresar términos para buscar GIFs relacionados y ver los resultados en una cuadrícula dinámica.",
        "tecnologias": [
            "Tailwind CSS",
            "JavaScript",
            "React",
            "Vite"
        ]
    },
    {
        "titulo": "Heroes App",
        "imagen": "/proyectos/framework/Heroes.png",
        "galeria": [
            "/proyectos/framework/Heroes1.png",
            "/proyectos/framework/Heroes2.png",
            "/proyectos/framework/Heroes3.png"
        ],
        "descripcion": "Este proyecto es una aplicación web que permite buscar y visualizar imagenes de tipo gif gracias a la API de Giphy, desarrollada con React y Vite.",
        "proposito": "El consumo de APIs externas y el manejo del estado en una aplicación React utilizando Vite como herramienta de construcción, en esta oportunidad con una interfaz mejor elaborada y organizada",
        "funcionamiento": "La aplicación cuenta con un dashboard de presentacion y tres modulos nombrados como Marvel, DC y Anime que son indicativos de los tipos de heroes que se pueden buscar y visualizar en la aplicación. En cada modulo se presenta un panel de busqueda para el usuario.",
        "tecnologias": [
            "Tailwind CSS",
            "JavaScript",
            "React",
            "Vite",
            "Bootstrap-icons"
        ]
    },
    {
        "titulo": "Anime Vault",
        "imagen": "/proyectos/framework/Anime.png",
        "galeria": [
            "/proyectos/framework/Anime1.png",
            "/proyectos/framework/Anime2.png"            
        ],
        "descripcion": "Esta pagina muestra tarjetas de animes populares consumiendo una API, desarrollada con React y NextJs.",
        "proposito": "El propósito de este proyecto es aprender a consumir APIs externas y manejar el estado en una aplicación React utilizando NextJs como framework de construcción.",
        "funcionamiento": "En la pagina principal se muestran tarjetas de animes populares y continua cargando mas animes cuando sigue bajando la pagina.",
        "tecnologias": [
            "Tailwind CSS",
            "TypeScript",
            "React",
            "NextJs"
        ]
    },
    {
        "titulo": "Peliculas",
        "imagen": "/proyectos/framework/Pelicula.png",
        "galeria": [
            "/proyectos/framework/Pelicula1.png",
            "/proyectos/framework/Pelicula2.png",
            "/proyectos/framework/Pelicula3.png"            
        ],
        "descripcion": "Este proyecto es un buscador de peliculas que consume una API externa, desarrollado con React y Vite.",
        "proposito": "Como objetivo se desarrolla este trabajo para aprender a consumir APIs externas y manejar el estado en una aplicación React utilizando Vite como framework de React.",
        "funcionamiento": "En la pagina principal se encuentra una barra de busqueda para ingresar la palabra clave de la pelicula y que se muestre una tarjeta con la informacion de la busqueda y se reinicie con cada nueva busqueda.",
        "tecnologias": [
            "Tailwind CSS",
            "TypeScript",
            "React",
            "Vite"
        ]
    }
]